In [1]:
# merging data Frames

import pandas as pd
df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],index=['Store 1','Store 2','Store 3'])
df

         Cost Item Purchased   Name
Store 1  22.5         Sponge  Chris
Store 2   2.5   Kitty Litter  Kevyn
Store 3   5.0          Spoon  Filip

In [4]:
df['Date'] = ['Dec 1', 'Jan 1', 'mid-May']
df

         Cost Item Purchased   Name     Date
Store 1  22.5         Sponge  Chris    Dec 1
Store 2   2.5   Kitty Litter  Kevyn    Jan 1
Store 3   5.0          Spoon  Filip  mid-May

In [7]:
df['Delivered'] = True
df

         Cost Item Purchased   Name     Date  Delivered
Store 1  22.5         Sponge  Chris    Dec 1       True
Store 2   2.5   Kitty Litter  Kevyn    Jan 1       True
Store 3   5.0          Spoon  Filip  mid-May       True

In [8]:
df['feedback'] = ['Positive',None,'Negative']
df

         Cost Item Purchased   Name     Date  Delivered  feedback
Store 1  22.5         Sponge  Chris    Dec 1       True  Positive
Store 2   2.5   Kitty Litter  Kevyn    Jan 1       True      None
Store 3   5.0          Spoon  Filip  mid-May       True  Negative

In [9]:
adf = df.reset_index()
adf

     index  Cost Item Purchased   Name     Date  Delivered  feedback
0  Store 1  22.5         Sponge  Chris    Dec 1       True  Positive
1  Store 2   2.5   Kitty Litter  Kevyn    Jan 1       True      None
2  Store 3   5.0          Spoon  Filip  mid-May       True  Negative

In [16]:
adf['Date']= ['Dec 1',None,'Dec 2']

In [17]:
adf

     index  Cost Item Purchased   Name   Date  Delivered  feedback
0  Store 1  22.5         Sponge  Chris  Dec 1       True  Positive
1  Store 2   2.5   Kitty Litter  Kevyn   None       True      None
2  Store 3   5.0          Spoon  Filip  Dec 2       True  Negative

In [18]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df

    Name            Role
0  Kelly  Director of HR
1  Sally  Course liasion
2  James          Grader

In [19]:
staff_df = staff_df.set_index('Name')

In [24]:
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')
print(staff_df)
print()
print(student_df)

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [32]:
# merge of two data frames 
# here how = 'outer' means that 1st data set union with 2nd data set
# we can also say that how is join
pd.merge(student_df,staff_df,how='outer',left_index=True,right_index=True)

            School            Role
Name
James     Business          Grader
Kelly          NaN  Director of HR
Mike           Law             NaN
Sally  Engineering  Course liasion

In [33]:
# how = 'inner' means that the intersection of data sets
pd.merge(staff_df,student_df,how='inner',left_index=True,right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [34]:
staff_df = staff_df.reset_index()

In [36]:
student_df = student_df.reset_index()

In [37]:
staff_df

    Name            Role
0  Kelly  Director of HR
1  Sally  Course liasion
2  James          Grader

In [38]:
student_df

    Name       School
0  James     Business
1   Mike          Law
2  Sally  Engineering

In [40]:
pd.merge(staff_df,student_df,how='outer',left_on='Name',right_on='Name')

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally  Course liasion  Engineering
2  James          Grader     Business
3   Mike             NaN          Law

In [44]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])
pd.merge(staff_df,student_df, how='left', left_on='Location',right_on='Location')

            Location Name_x            Role Name_y School
0       State Street  Kelly  Director of HR    NaN    NaN
1  Washington Avenue  Sally  Course liasion    NaN    NaN
2  Washington Avenue  James          Grader    NaN    NaN